[{
    "p": ["El mar está en calma. Los navíos en posición. La travesía marcha rumbo de la capital. El almirante exhala tranquilo. Camino de la taberna observa que la puerta del camarote del emperador se encuentra abierta de par en par. Escucha al emperador susurrando cálculos mientras mueve agilmente su pluma sobre un pedazo de papiro continuo. El almirante llama con discreción a la puerta. El emperador para en seco, pero sin levantar la pluma del papiro. Levantó la cabeza, abrió los ojos y clavó su mirada en el almirante al almirante.",
      "-Pase almirante - dice Lieb con tono tranquilo -. ¿A que se debe su visita? ¿Requiere usted de mi presencia?",
      "- No quería importunarle emperador. Simplemente venía a informar de la situación actual. Según mis cálculos deberíamos llegar en apenas 25 ciclos.",

      "- Agradezco su informe. ¿A que se debe su visita? Lleva muchos años a mi servicio y puedo asegurar que hay algo le inquieta. Tome asiento.",

      "- No se preocupe Emperador... Era simple curiosidad. Le noté algo inquieto cuando embarcó y me preguntaba... Quiero decir, no es usual iniciar una travesía de esta envergadura con tal impronta. ¿Corre peligro el imperio?",

      "- Mi imperio está a salvo. Al menos en este instante. Si tiene tiempo le contaré en detalle los motivos de está inusual travesía. -El emperador notó un ligero asentimiento por parte del almirante- Tome asiento, se lo ruego.",

      "Lieb le habló de las tareas conocidas como divinas y de cómo los diferentes imperios cuentan leyendas de deidades capaces de resolver dichas tareas. Le habló también de los juicios, qué son, por qué se celebran y cómo los más importantes, según el propósito de estos, requieren de la presencia de autoridades de los diferentes imperios para poder dictar sentencia.",

      "Poco a poco las palabras del emperador se tornaron en susurros y la pluma empezó a moverse con mayor agilidad por el papiro. Susurros y trazos se entremezclaban. El almirante se dejó guiar por la tridimensionalidad del discurso. Percibió con asombro que su viaje tenía como objetivo acudir a un Juicio. Quedó perplejo al descubrir que el Obispo había convocado a todos los emperadores y duques de Sampo. Sintió el miedo y la incertidumbre de su emperador.",

      "Lieb soltó drásticamente la puma y esta rodó por la mesa dejando puntos de tinta sobre el papiro hasta que finalmente cayó al suelo. En 27 días se celebraría el profetizado Juicio Final. En tan sólo 27 días se decidiría si la humanidad sería capaz de realizar tareas divinas o por el contrario, nunca podría aspirar a tal privilegio.",


      "- Le acompaño en sentimiento señor, pero no en entendimiento – Titubeó el almirante – Le ruego no dude de mi fé, pero nunca llegué a comprender con fluidez la Clasificación de Tareas. ¿Qué significa exactamente que los humanos podamos realizar o no tareas divinas? ¿Acaso no podemos ya juzgar si una tarea divina ha sido acometida o no con eficacia? De verdad que no logro comprender su miedo mi señor...",

      "- No se preocupe por su falta de comprensión. Muy noble por su parte admitirlo. -Decía Lieb mientras buscaba la pluma por el escritorio – Y en efecto, podemos juzgar si una tarea divina ha sido realizada con exactitud o no, es nuestra forma de reconocerlas. Ayúdeme a encontrar la pluma.",

      "El almirante se quedó sorprendido y algo inquieto al ver una linea discontinua de puntos sobre el papiro del emperador. Observó que el camino de puntos se extendía por el suelo del camarote. Los primeros puntos de tinta del suelo distaban entre sí más que los puntos del papiro. Intentó imaginarse una linea curva que uniera un punto con el siguiente. Pronto comprendió que esa linea marcaba la ruta que había seguido la pluma al rodar por el suelo del camarote. Se levantó de la silla y recorrió el camarote tal cual supuso que había hecho instantes previos el objeto perdido.",

      "- Aquí esta su pluma Emperador -exclamó orgulloso el almirante.",

      "- Perfecto. Ya que está de pié, traiga esa caja de miniaturas navales. -Le pedía el emperador mientras avanzaba el papiro continuo sobre su escritorio hasta que no quedó un solo trazo de tinta visible sobre la mesa- Nos serán útiles.",

      "El almirante volvió a la mesa del emperador y colocó la caja a su izquierda. Permaneció en silencio. El emperador estaba absorto en sus pensamientos. El silencio en la sala era total. Aun con la puerta del camarote abierta no se escuchababa un solo ruido. Cuando el almirante empezó a dudar del importunio que podía generar su presencia en su emperador, se sorprendió al escuchar un ligero zumbido. Poco a poco el zumbido se convirtió en susurro y la pluma del emperador comenzó a danzar agilmente por el papiro. El emperador había retomado el trance previo a su intromisión. Hizo un ligero amago de levantarse pero volvió a caer de inmediato sobre su silla. El emperador le hablaba a él. Sus ojos estarían cerrados de no ser así.",

      "- Y bien, sabrías completar este mapa, ¿cierto? -Dijo el Emperador entre susurros justo antes de quedarse mirando fijamente a su invitado.",

      "El almirante no fue capaz de entender nada más de lo que había dicho su emperador. No tenía sentido mirar al papiro, los trazos no significan nada por si solos. Por suerte conocía acerca de los mapas de Väino. Tuvo que completar uno como prueba de acceso de la Academia Naval. Las piezas que estaban colocadas no podían cambiarse. En las casillas libres se deberán colocar piezas de mar o navíos, según marquen los números del borde.",
      "<i>(Haz clic sobre una casilla libre para iterar entre «mar», «navío» y «casilla vacía»)</i>"

    ],

    "game": {
      "rowData": [0, 1, 0],
      "colData": [0, 1, 0],
      "hints": [
        [0, 0, "W"],
        [2, 2, "W"],
        [0, 2, "W"],
        [2, 0, "W"],
        [2, 1, "W"],
        [1, 2, "W"],
        [1, 0, "W"],
        [0, 1, "W"]
      ],
      "ships": [1, 0, 0],
      "cellSize": 100
    }
  },
  {
    "p": ["- Bien bien. Vamos a ir calentando poco a poco con ejemplos sencillos.",
      "El Emperador quitó las piezas de mar de las esquinas e invitó al almirante a completar el mapa de nuevo. El almirante dudó por un segundo. ¿Habrá algún truco? Sin pensarlo mucho, completó el puzzle. Lo unico que tenía que hacer era volver a colocar las fichas de mar."

    ],
    "game": {
      "rowData": [0, 1, 0],
      "colData": [0, 1, 0],
      "hints": [
        [1, 1, "B0"],
        [2, 1, "W"],
        [1, 2, "W"],
        [1, 0, "W"],
        [0, 1, "W"]
      ],
      "ships": [1, 0, 0],
      "cellSize": 100
    }
  },
  {
    "p": ["- En efecto almirante. Un mapa ha de tener todas las fichas colocadas. No importa si sólo quedan por colocar fichas de mar. Si el mapa no está completo, no se puede verificar si es correcto o no. Al fin y al cabo, una casilla vacía podría ser tanto una ficha de barco como una porción de mar.",
      "- Me hizo dudar Emperador. Pensé que eso se daba por supuesto.",
      "- Nunca está de más especificar. Me gusta asegurarme que ambos hablamos en los mismos términos. Si no, corremos el riesgo de discutir en vez de debatir. Pero tampoco quiero entretenerme en repetirle reglas que ya conoce. Tome las piezas. Muestreme usted las reglas de los mapas de Väino.",
      "- Con mucho gusto Emperador.",
      "Un mapa de Väino es en esencia un tablero cuadrado o rectangular donde se representa mediante fichas y figuras una situación naval. Para determinar que un mapa de Väino ha sido resuelto correctamente, se deben verificar cuatro reglas:",
      "Regla Primera: Todas las fichas navales disponibles han de ser colocadas en la grilla.<br><i>[Imagen de un mapa señalando las fichas de barco disponibles]</i>",
      "Regla Segunda: Las fichas ya colocadas no pueden ser cambiadas.<br><i>[Imagen de mapa señalando las fichas ya colocadas]</i>",
      "Regla Tercera: Dos barcos diferentes no podrán ocupar casillas adyacentes, ni lateralmente ni diagonalmente.<br><i>[Imagen de mapa señalando un barco adyacente a otro ambos color rojo]</i>",
      "Regla cuarta: las indicaciones verticales y horizontales han de ser respetadas. En cada fila o columna habrá el número de piezas navales que se indica al borde del tablero."
    ],
    "game": {
      "rowData": [3, 0, 2, 1],
      "colData": [2, 0, 3, 1],
      "hints": [
        [1, 1, "W"],
        [2, 1, "W"],
        [1, 2, "W"],
        [1, 0, "W"],
        [0, 1, "W"],
        [2,2, "B3C"],
        [3,2, "B1C"]
      ],
      "ships": [2, 2, 0],
      "cellSize": 90
    }
  }, {
    "p": ["- Impoluto almirante. Una definición muy formal. No obstante, eché en falta un ligero detalle. No mencionó que resolver un mapa de Väino es una tarea divina.",
      "El emperador se levantó de su silla y empezó a deambular por el camarote mientras continuaba su conversación con el hábil marinero.",
      "- ¿Y por qué iba a mencionarlo? He resuelto un par ante sus ojos. Si en verdad lo fueran, estaría usted hablando con una divinidad y créame emperador, soy un noble almirante. Nada más.",
      "- No se alarme Almirante. No creo que sea una divinidad. Al fin y al cabo todos han sido ejemplos sencillos.",
      "- Eso es cierto. Los dos primeros que usted planteó, no tenían mucho misterio a decir verdad. En parte este ultimo que usé para ejemplificar las reglas, lo tenía pensado de antemano, luego tecnicamente no lo he resuelto. Pero estoy seguro de que cualquier otro estudiante lo podría haber resuelto sin saber la respuesta de antemano... ¿Hay alguna propiedad que haga que un mapa de Väino sea sencillo de resolver?",
      "- No se equivoca. ¿Que cree usted que hace a estos mapas sencillos de resolver? ¿Qué particularidad cree que los hace resolubles por nosotros los humanos?",
      "- Podría decir que han sido planteados por nosotros los humanos. Pero no tendría sentido, pues muchas son las tareas planteadas por humanos que aun no han sido acometidas por ninguno de nosotros. Como el dilema del mercader...",
      "- Está en lo cierto, esa no es la particularidad que nos hace capaces de resolver estos problemas. No es lo que los hace sencillos. ¿Qué característica crees que comparten estos pequeños ejemplos?",
      "- No sabría decirle Emperador. Creame que no mentía cuando afirmaba no conocer con fluidez la clasificacion de tareas... ¿Quizá que hay piezas ya fijas? ¿Es la Segunda Regla la que nos permite resolverlos?",
      "- Tranquilicese almirante, no diga tonterías. Es algo mas simple que eso... Recuerde que busco ejemplificar las tareas divinas con este ejemplo, y no todas las tareas divinas precisan de esa segunda regla. Cómo bien mencionó, el dilema del mercader tambien es conocido por su complejidad divina. Todos conocemos la leyenda del meta-mercader capaz de elegir de su alcoba de innumerables tesoros, solo los objetos justos que maximicen su beneficio cada vez que emprende su ruta comercial. No obstante, eso no limita que existan pequeños mercaderes que deban discernir si podrán conseguir un salario minimo con los pocos objetos que poseen antes de emprender sus rutas comerciales.",
      "- El meta-mercader... ¿Usted cree que algún dia se conocerá su identidad? ¿Será acaso real? Oí que muchos pueblos están envíando a sus mercaderes más hábiles al templo divino. ¿Usted cree que alguno podrá superar las pruebas del Templo?",
      "- Amigo, eso es algo que no puedo responderle. Quizá en el viaje de vuelta pueda darle respuestas, aunque ni yo se si quiero conocerlas...",
      "El rostro del emperador se quedo petrificado. Su mirada estaba fija en el mar. Lo obserbaba a través de una de las claraboyas de la sala. Su imperio se perdía poco a poco en la inmensidad del mar. Ya no había rastro de la ciudad imperial. Algunas pequeñas islas se difuminaban en el horizonte. El almirante notó la inquietud de su emperador.",
      "- Mire emperador. Creo que he encontrado lo que nos permite resolver ciertas tareas. - Exclamó el almirante fingiendo no estar al tanto de las emociones de Lieb- Intente resolver este mapa.",
      "Lieb dio media vuelta y se sentó de nuevo.",
      "- Muestreme almirante.",
      "- ¿Sería capaz de resolver este mapa?"
    ],
    "game": {
      "rowData": [4, 0, 2,1,2,1],
      "colData": [1, 0, 4,0,3,2],
      "hints": [  ],
      "ships": [3, 2, 1],
      "cellSize": 80
    }
  },
  {
    "p": ["- Este fue algo ligeramente mas difícil almirante... ¿Ha dado con la clave de la complejidad?",
      "- Eso creo Lieb - afirmó con alegría.",
      "- Dígame pues - le replicó el Emperador con expectación",
      "- Es la falta de pistas Emperador. El mapa no tenía ni una sola casilla fija. La única información que le dí fueron las indicaciones verticales y horizontales.",
      "- Seré benevolente con usted... Recapacite."
    ],
    "game": {
      "rowData": [1, 2, 3,2,1,1],
      "colData": [3, 0, 3,1,1,2],
      "hints": [
        [0, 0, "B3C"],
        [2, 5, "B1R"]
      ],
      "ships": [3, 2, 1],
      "cellSize": 80
    }
  },
  {
    "p": ["- Este fue duro Emperador...",
      "- En efecto. Y tenía mas pistas que el que usted me planteó anteriormente.",
      "- Ciertamente... - afirmó el almirante con un ligero tono triste",
      "Sin prestar apenas atencion al comentario del almirante, el emperador prosiguió su lección",
      "- Si esa fuera la propiedad que hace a un mapa de Väino sencillo o dificil, si la presencia o ausencia de pistas fuera lo que nos permite determinar la complejidad que presenta resolver un mapa, le tendría que haber dado la razon antes. Usted afirmó que la Segunda Regla era lo que hacía a estos mapas sencillos. No obstante concluimos que no era esa característica pues mi objetivo es ejemplificar las tareas divinas en su generalidad, no esta en particular. De hecho, mire. Intente resolver este mapa. Tiene un elemento diferente al que usted propuso. Y le puedo asegurar que no me refiero a la cantidad de pistas... ¿Qué cree usted que lo hace ligeramente más complejo de resolver?"
    ],
    "game": {
      "rowData": [3,2,3,2,4,1,2,2],
      "colData": [0, 5, 0,4,2,3,2,3],
      "hints": [
        [6, 1, "B1C"],
        [3, 5, "B3C"]
      ],
      "ships": [3, 2, 1],
      "cellSize": 80
    }
  },
  {
    "p": ["- ¡Es la escala!"]
  }



]
