[{
    "p": ["El mar está en calma. Los navíos en posición. La travesía marcha rumbo de la capital. El almirante exhala tranquilo. Camino de la taberna observa que la puerta del camarote del emperador se encuentra abierta de par en par. Escucha al emperador susurrando cálculos mientras mueve agilmente su pluma sobre un pedazo de papiro continuo. El almirante llama con discreción a la puerta. El emperador para en seco, pero sin levantar la pluma del papiro. Levantó la cabeza, abrió los ojos y clavó su mirada en el almirante al almirante.",
      "-Pase almirante - dice Lieb con tono tranquilo -. ¿A que se debe su visita? ¿Requiere usted de mi presencia?",
"- No quería importunarle emperador. Simplemente venía a informar de la situación actual. Según mis cálculos deberíamos llegar en apenas 25 ciclos.",

"- Agradezco su informe. ¿A que se debe su visita? Lleva muchos años a mi servicio y puedo asegurar que hay algo le inquieta. Tome asiento.",

"- No se preocupe Emperador… Era simple curiosidad. Le noté algo inquieto cuando embarcó y me preguntaba… Quiero decir, no es usual iniciar una travesía de esta envergadura con tal impronta. ¿Corre peligro el imperio?",

"- Mi imperio está a salvo. Al menos en este instante. Si tiene tiempo le contaré en detalle los motivos de está inusual travesía. -El emperador notó un ligero asentimiento por parte del almirante- Tome asiento, se lo ruego.",

"Lieb le habló de las tareas conocidas como divinas y de cómo los diferentes imperios cuentan leyendas de deidades capaces de resolver dichas tareas. Le habló también de los juicios, qué son, por qué se celebran y cómo los más importantes, según el propósito de estos, requieren de la presencia de autoridades de los diferentes imperios para poder dictar sentencia. </br> Poco a poco las palabras del emperador se tornaron en susurros y la pluma empezó a moverse con mayor agilidad por el papiro. Susurros y trazos se entremezclaban. El almirante se dejó guiar por la bidimensionalidad del discurso. Percibió con asombro que su viaje tenía como objetivo acudir a un Juicio. Quedó perplejo al descubrir que el Obispo había convocado a todos los emperadores y duques de Sampo. Sintió el miedo y la incertidumbre de su emperador.",

"Lieb soltó drásticamente la puma y esta rodó por la mesa dejando puntos de tinta sobre el papiro hasta que finalmente cayó al suelo. En 27 días se celebraría el profetizado Juicio Final. En tan sólo 27 días se decidiría si la humanidad sería capaz de realizar tareas divinas o por el contrario, nunca podría aspirar a tal privilegio.",


"- Le acompaño en sentimiento señor, pero no en entendimiento – Titubeó el almirante – Le ruego no dude de mi fé, pero nunca llegué a comprender con fluidez la Clasificación de Tareas. ¿Qué significa exactamente que los humanos podamos realizar o no tareas divinas? ¿Acaso no podemos ya juzgar si una tarea divina ha sido acometida o no con eficacia? De verdad que no logro comprender su miedo mi señor…",

"- No se preocupe por su falta de comprensión. Muy noble por su parte admitirlo. -Decía Lieb mientras buscaba la pluma por el escritorio – Y en efecto, podemos juzgar si una tarea divina ha sido realizada con exactitud o no, es nuestra forma de reconocerlas. Ayúdeme a encontrar la pluma.",
"El almirante se quedó sorprendido y algo inquieto al ver una linea discontinua de puntos sobre el papiro del emperador. Observó que el camino de puntos se extendía por el suelo del camarote. Los primeros puntos de tinta del suelo distaban entre sí con más que los puntos del papiro. Intentó imaginarse una linea curva que uniera un  punto con el siguiente. Pronto comprendió que esa linea marcaba la ruta que había seguido la pluma al rodar por el suelo del camarote. Se levantó de la silla y recorrió el camarote tal cual supuso que había hecho instantes previos el objeto perdido. Los puntos cada vez distaban menos entre sí.",

"- Aquí esta su pluma Emperador.",

"- Perfecto almirante. Ya que está de pié, traiga esa caja de miniaturas navales. -Le pedía el emperador mientras avanzaba el papiro continuo sobre su escritorio hasta  que no quedó un solo trazo de tinta visible sobre la mesa- Nos serán útiles.",

"El almirante volvió a la mesa del emperador y colocó la caja a su izquierda. Permaneció en silencio. El emperador estaba absorto en sus pensamientos. El silencio en la sala era total. Aun con la puerta del camarote abierta no se escuchababa un solo ruido. Cuando el almirante empezó a dudar del importunio que podía generar su presencia en su emperador, se sorprendió al escuchar un ligero zumbido. Poco a poco el zumbido se convirtió en susurro y la pluma del emperador comenzó a danzar agilmente por el papiro. El emperador había retomado el trance previo a su intromisión. Hizo un ligero amago de levantarse y volvió a caer sobre su silla. El emperador le hablaba a él. Sus ojos estarían cerrados de no ser así. ",

"- Y bien, sabrías completar este mapa de Väino, ¿cierto?",

"El almirante no fue capaz de entender nada más de lo que había dicho su emperador. No tenía sentido mirar al papiro, los trazos no significan nada por si solos. Por suerte conocía acerca de los mapas de Väino. Tuvo que completar uno como prueba de acceso a la Academia Naval. Las piezas que estaban colocadas no podían cambiarse. En las casillas libres se debe indicar si serán mar o un navío, según marquen los números del borde."

    ],

    "game": {
      "rowData": [0, 1, 0],
      "colData": [0, 1, 0],
      "hints": [
        [0, 0, "W"],
        [2, 2, "W"],
        [0, 2, "W"],
        [2, 0, "W"]
      ],
      "ships": [1, 0, 0],
      "cellSize": 100
    }
  },
  {
    "p": ["*El emperador propone una serie de puzzles para que el almirante reflexione sobre las reglas del juego"],
    "game": {
      "rowData": [1, 1, 0],
      "colData": [0, 2, 0],
      "hints": [
        [0, 0, "W"],
        [2, 2, "W"],
        [0, 2, "W"],
        [2, 0, "W"]
      ],
      "ships": [0, 1, 0],
      "cellSize": 100
    }
  },
  {
    "p": ["Continuara"]
}


]
